-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 07, 2024 at 01:27 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `data`
--

-- --------------------------------------------------------

--
-- Table structure for table `config`
--

CREATE TABLE `config` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `value` varchar(100) DEFAULT NULL,
  `note` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `config`
--

INSERT INTO `config` (`id`, `name`, `value`, `note`) VALUES
(1, 'company_name', 'ZAMIL OFFSHORE SERVICES COMPANYT', NULL),
(2, 'company_bldg', 'AL-ZAMIL BLDG - AL BANDARIYAH', NULL),
(3, 'company_pobox', 'AL-ZAMIL BLDG - AL BANDARIYAH', NULL),
(4, 'company_tel', 'TEL: 03-882-2494, 03-882-2495, FAX-03-882-2032', NULL),
(5, 'company_cr', '2051003290 ', NULL),
(6, 'company_vat', '310132626800003', NULL),
(7, 'company_name_ar', ' تليفون :2494-882-013 , فاكس : 2032-882-013', NULL),
(8, 'company_bldg_ar', 'بناية الزامل - حى البندرية', NULL),
(9, 'company_pobox_ar', 'ص.ب 1922, الخبر  31952 , المملكة العربية السعودية', NULL),
(10, 'company_tel_ar', 'تليفون :2494-882-013 , فاكس : 2032-882-013', NULL),
(11, 'cc1', '104.1260.41111.00000.000000.000.00000', NULL),
(12, 'cc2', '104.1810.41111.00000.000000.000.00000', NULL),
(13, 'vat', '15', NULL),
(14, 'company_logo', 'logo.png', NULL),
(15, 'company_contract', 'بناية الزامل - حى البندرية', NULL),
(16, 'company_vendor', '10005686', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `invoice`
--

CREATE TABLE `invoice` (
  `id` int(11) NOT NULL,
  `no` varchar(50) NOT NULL,
  `ref_no` varchar(12) NOT NULL,
  `date` date NOT NULL,
  `amount` double NOT NULL,
  `supplier` int(11) NOT NULL,
  `sappo` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `invoice`
--

INSERT INTO `invoice` (`id`, `no`, `ref_no`, `date`, `amount`, `supplier`, `sappo`) VALUES
(1, '96546245625', '66954', '2022-08-02', 9696.36, 219, 5);

-- --------------------------------------------------------

--
-- Table structure for table `sappo`
--

CREATE TABLE `sappo` (
  `id` int(11) NOT NULL,
  `no` varchar(50) DEFAULT NULL,
  `name` varchar(100) DEFAULT NULL,
  `amount` double DEFAULT NULL,
  `is_paid` varchar(10) DEFAULT 'No',
  `is_active` int(11) NOT NULL DEFAULT 1,
  `note` text DEFAULT NULL,
  `create_date` datetime NOT NULL DEFAULT current_timestamp(),
  `update_date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `sappo`
--

INSERT INTO `sappo` (`id`, `no`, `name`, `amount`, `is_paid`, `is_active`, `note`, `create_date`, `update_date`) VALUES
(1, '6511074663', 'project1', 541265, 'Yes', 1, 'dggffdgfdts gsfg fsg ', '2022-08-20 05:04:48', '2022-08-20 05:29:55'),
(2, '6511074664', 'Project 56789', 96952365.32, 'Partial', 1, '  ', '2022-08-20 05:04:48', '2022-08-20 06:16:16'),
(3, '6511074665', 'Project 56789652', 56.36, 'Partial', 1, 'gfgfdgfd', '2022-08-20 05:04:48', '2022-08-20 06:53:45'),
(4, '6511074669', 'Project 56789', 552.25, 'No', 1, '', '2022-08-20 05:04:48', '2022-08-20 06:16:06'),
(5, '6511074668', 'Project 5653', 1250520.52, 'Partial', 1, '', '2022-08-20 05:04:48', '2022-08-20 06:53:52'),
(6, 'sdfdsrefdfs', 'dsfsf', 0, 'No', 0, ' 3333333333', '2022-08-20 05:19:15', '2022-08-20 05:22:37'),
(7, 'hsljkds52ds', 'Project', 6789.65, 'No', 0, 'jsdhsdkhkjndsmfjk ', '2022-08-20 05:32:02', '2022-08-20 05:36:42'),
(8, '666666', 'dssdfsdf', 45656, 'Yes', 1, ' dfghdfg', '2022-08-20 05:55:44', '2022-08-20 06:58:07');

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `cr` varchar(20) NOT NULL,
  `vat` varchar(20) NOT NULL,
  `conatct` text DEFAULT NULL,
  `is_active` int(11) NOT NULL DEFAULT 1,
  `create_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `update_date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `suppliers`
--

INSERT INTO `suppliers` (`id`, `name`, `cr`, `vat`, `conatct`, `is_active`, `create_date`, `update_date`) VALUES
(288, 'Sashiko', '2051231206', '8303901590079326744', '  asdsadsad', 0, '2022-08-18 17:46:26', '2022-08-19 20:45:04'),
(289, 'Addict', '2050134531', '1470242330088811830', '  ', 0, '2022-08-18 17:46:26', '2022-08-19 20:44:55'),
(291, 'aaaaa', '2050139899', '4741915211184319848', ' ', 0, '2022-08-18 17:46:26', '2022-08-19 20:44:49'),
(292, 'مؤسسة الرصد المتابعة لصيانة المعدات', '2051229255', '8609902341617732867', ' ', 0, '2022-08-18 17:46:26', '2022-08-18 17:09:34'),
(295, 'مؤسسة خبراء الاسناد للمقاولات العامة', '2050135521', '5471324538773599327', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(296, 'مؤسسة نايف محمد علي القحطاني للمقاولات العامة', '2050135837', '9355148370446575448', '     xzccxzxcx\r\nzxzc\r\nxzc\r\nxzc\r\nxzc\r\ncxz', 1, '2022-08-18 17:46:26', '2022-08-19 07:44:45'),
(297, 'sssasas', '2051230553', '8487575591548983317', ' ', 0, '2022-08-18 17:46:26', '2022-08-19 20:45:11'),
(298, 'مؤسسة هدف الريادة للمقاولات العامة', '2051232396', '2433587455106864704', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(299, 'مؤسسة يوسف سالم بن عبدالعزيز الوشمي للمقاولات العامة', '2051232782', '7754727519557102175', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(300, 'مؤسسة سعيد متعب طامي الهاجري للمقاولات العامة', '2055100000', '8955846050352154256', ' ', 1, '2022-08-18 17:46:26', '2022-08-19 07:47:10'),
(301, 'مؤسسة تركي عبدالله عيسى العجمي للمقاولات العامة', '2060622902', '8503634786569690557', '', 1, '2022-08-18 17:46:26', '2022-08-19 07:48:15'),
(302, 'مؤسسة سمر عائش عبدالله العتيبي للمقاولات العامة', '2050132006', '1224114463596484436', '', 1, '2022-08-18 17:46:26', '2022-08-19 07:48:28'),
(303, 'مؤسسة فهد بن صالح بن حسن اليامي للمقاولات', '2050140256', '4616211642681058103', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(304, 'مؤسسة ابتكار الريادة للمقاولات العامة', '2051231090', '9641564170625754482', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(305, 'مؤسسة قايد صالح حسين القحطاني للمقاولات', '2051231869', '1836830570306633286', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(306, 'أكاديمية فرسان الخليج الرياضية', '2050138250', '6101490047348167765', ' ', 1, '2022-08-18 17:46:26', '2022-08-20 00:58:26'),
(307, 'مكتب راشد علي راشد الهتلان للاستشارات الأمنية', '2050134777', '2081601141792869367', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(308, 'شركة جازل للاستشارات الأمنية', '2051232186', '9591910246626935393', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(309, 'مكتب الراي السديد للاستشارات الأمنية', '2051232850', '3559377267831169259', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(311, 'شركة شروق الأمل للمقاولات المعمارية العامة', '2051233154', '4517641788059376287', ' ', 1, '2022-08-18 17:46:26', '2022-08-19 04:21:37'),
(314, 'شركة شدن للتجارة', '2050133143', '4500041000059326287', '   ', 1, '2022-08-18 17:46:26', '2022-08-19 04:22:41'),
(315, 'يحسن علي حسن آل الزعبي التجارية', '2050038741', '6489809946294556865', '   ', 1, '2022-08-18 17:46:26', '2022-08-19 07:29:07'),
(316, 'مؤسسة أحمد فوزي بن علي آل الشيخ التجارية', '2050137901', '4280454111561206648', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(317, 'مؤسسة عادل محمد الشيوخ التجارية', '2050139682', '4784962452502398824', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(318, 'مؤسسة مهدي صالح بن عيسى المهري التجارية', '2051229304', '6753769480011527561', '  asdsadsadsadsasda', 1, '2022-08-18 17:46:26', '2022-08-19 08:31:36'),
(319, 'مؤسسة اسطورة الالوان التجارية', '2051231416', '6381334416226112981', '  2051229304d', 0, '2022-08-18 17:46:26', '2022-08-19 08:34:01'),
(320, 'مؤسسة عبدالرحمن مروان عمر الغامدي التجارية', 'D2051231648', 'S3223601888758536584', '          sadsadd', 1, '2022-08-18 17:46:26', '2022-08-19 09:48:11'),
(321, 'مؤسسة ابتكار الالوان التجارية', '2051232583', '1313711986722514935', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(322, 'مؤسسة عالية العربية للتجارة', '2051233083', '1691506946231747432', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(323, 'محل دهانات الوطنية التجارية', '2055127351', '8022247922812194313', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(324, 'شركة مصنع الجزيره للدهانات', '2055128129', '8360234654444032322', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(325, 'مؤسسة اروى خلف فالح القنزع التجارية', '2057472929', '5304705435651649493', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(326, 'مؤسسة خلود خالد سيف العازمي التجارية', '2057472942', '7596510592491083417', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(327, 'مؤسسة سحر عبدالله بن خلف الشمري التجارية', '2057472960', '7802259370235201459', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(328, 'مؤسسة مها راضي بن حامد العنزي التجارية', '2057472967', '9732482989454717194', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(329, 'مؤسسة الطاف تركى بن غريب الخالدى التجارية', '2057472968', '9425827714704686181', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(330, 'مؤسسة ضحى راضي بن حامد العنزي التجارية', '2057472969', '3399714529728785351', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(331, 'مؤسسة بدر محمد خلوي الظفيري التجارية', '2057472971', '3054896329701921902', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(332, 'مؤسسة تهاني حماد ذيبان الشمري التجارية', '2057472983', '7696359722353953878', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(333, 'مؤسسة ناصر سالم عبدالمحسن العجمي التجارية', '2057472987', '1394975837855610651', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(334, 'مؤسسة صالح حمود عبيد الشمري التجارية', '2057472994', '2978749974387278499', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(335, 'مؤسسة عطاالله بن مبارك بن صلف المطيري التجارية', '2057473009', '7029733267823381307', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(336, 'مؤسسة محمد علوش بن محمد القحطاني التجارية', '2057473013', '5961627413422407160', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(337, 'مؤسسة تركي فهد بن محمد العتيبي التجارية', '2057473024', '9218559983712109712', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(338, 'مؤسسة عبدالرحمن عبد الله شرعان الظفيري التجارية', '2057473030', '3744323095253300949', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(339, 'مؤسسة نجلاء عجير ابن غالي العازمي التجارية', '2057473033', '9487183155244939757', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(340, 'مؤسسة حسن عوض حسن العنزي التجارية', '2057473035', '8483772795714018763', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(341, 'مؤسسة دلال محمد صنيتان العتيبي التجارية', '2057473049', '9187147364347038209', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(342, 'مؤسسة صباح المزينى عائض العتيبي التجارية', '2057473063', '9591951024245966945', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(343, 'مؤسسة منى سعد شباب العتيبي التجارية', '2057473089', '2075966934066060601', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(344, 'مؤسسة نايف نخيلان منصور الشمري التجارية', '2057473158', '7871923265167881209', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(345, 'مؤسسة نظر مسلط بن مطلق العتيبي التجارية', '2057473314', '5243164243022113650', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(346, 'مؤسسة ماريه محمد بن فاضل الغامدي التجارية', '2057473344', '3804973291011344467', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(347, 'مؤسسة فاديه محمد بن فاضل الغامدي التجارية', '2057473346', '8928270187955515239', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(348, 'مؤسسة عبدالعزيز محمد بن فاضل الغامدي التجارية', '2057473375', '8817592178521402214', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(349, 'مؤسسة فرحه هليل عسكر الماجدي التجارية', '2057473383', '1754108570579499477', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(350, 'مؤسسة هاجر أحمد صايل الظفيري التجارية', '2057473477', '1754255424138797393', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(351, 'مؤسسة ابتسام ابراهيم ناصر المرشود التجارية', '2057473481', '4939446449346007152', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(352, 'مؤسسة حلا فهد بن مخلف الشمري التجارية', '2057473488', '3983521141595811239', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(353, 'مؤسسة سيف ثاني خليف الشمري التجارية', '2057473513', '2144624728223543883', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(354, 'مؤسسة فوزيه بنت عياد بن دغفق الشمري التجارية', '2057473533', '1456106030907501484', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(355, 'مؤسسة فهاد خليفه بن مطلق الشمري التجارية', '2057473546', '6981228942806449217', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(356, 'مؤسسة برغش حمود شرعان الظفيري التجارية', '2057473575', '6094184667006745790', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(357, 'مؤسسة نايف بن يوسف عيسى العمره التجارية', '2050132696', '1564731523758039370', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(358, 'مؤسسة هاجر حمدان علي الشمراني لمواد البناء', '2050135159', '7500381872121758952', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(359, 'مؤسسة مناهل المدينة التجارية', '2055129413', '7919265984128401489', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(360, 'مؤسسة مجال الإختصاص للتجارة', '2050132240', '7500414958248743898', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(361, 'مؤسسة ألاء لمواد البناء', '2050140914', '2240517127011420223', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(362, 'مؤسسة عالم المجد لمواد البناء', '2050141058', '8897414112451876699', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(363, 'مؤسسة الانجاز الامثل لمواد البناء', '2055128067', '7835772747658888609', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(364, 'شركة كلاس التجارية (شركة شخص واحد)', '2050133810', '4897327867258060828', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(365, 'مؤسسة ساره علي بن ناشي المسلم التجارية', '2050138080', '2759925977046414569', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(366, 'مؤسسة جمعه قاسم سلمان غزواني التجارية', '2050138768', '2780228176003044605', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(367, 'مؤسسة نور البلد التجارية', '2050140812', '6225258819878453145', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(368, 'مؤسسة فاطمه سعد علي السالم التجارية', '2051233070', '6065690247596495605', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(369, 'مؤسسة سالم صالح بن سالم ال جيده التجارية', '2050136480', '5339538471166653669', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(370, 'محل اللون الثامن للتجارة', '2050136189', '7119410115103571848', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(371, 'مؤسسة حسين تركي بن محمد الشوملي التجارية', '2050137745', '4234860139986076660', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(372, 'مؤسسة الأنامل السحرية التجارية', '2051233432', '6594959188896577900', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(373, 'مؤسسة أوتاد الجبيل التجارية', '2055128449', '4653233314692550322', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(374, 'مؤسسة الجسر الصلب للتجارة', '2050133485', '4866472652369780951', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(375, 'مؤسسة علي حسين بن عباس الجميعه التجارية', '2050134136', '9042415146246219430', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(377, 'مؤسسة مروي السديري صنيدح العنزي لتقنية المعلومات', '2050137685', '4606406562727723441', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(378, 'مؤسسة هياء أحمد بن نهار القحطاني التجارية', '2050138394', '3294858043435765646', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(379, 'محل صالحه محمد سعد الزهراني التجارية', '2050138404', '2645139762323186854', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(380, 'مؤسسة خالد محمد عايض الدوسري التجارية', '2051229277', '8725670323558084826', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(383, 'مؤسسة أديب امين عبدالحميد المجددي للتجارة', '2051232133', '2717204273047418136', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(384, 'مؤسسة رشيد راشد بن سعود الحربي للتجارة', '2055128470', '4994656049837617299', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(385, 'مؤسسة الخليج سوفت التجارية', '2060622768', '6768298823176019152', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(386, 'مؤسسة ريان محمد عياش ماحي للتجارة', '2066612086', '1491489224987988457', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(387, 'مؤسسة نايف ناصر موسى غبيسي للتجارة', '2066612148', '5071878381849240108', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(388, 'مؤسسة احمد بن عبدالرضاء بن احمد الحمود التجارية', '2050134462', '9697137549456385680', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(389, 'مؤسسة مستوره عطيه سفر الزهراني لبيع الجوالات وصيانتها', '2050138075', '4622731683683021877', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(390, 'مؤسسة ايزي ستور للتجارة', '2051230646', '8029933993927746454', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(391, 'مؤسسة ريدان الريادة للتجارة', '2050132385', '4458599910615507289', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(392, 'مؤسسة حذيفه عماد بن عبدالعزيز الرشود التجارية', '2050135629', '8157143142286834947', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(393, 'مؤسسة بروق الشرق للاتصالات', '2050133406', '1912786215723899988', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(394, 'مؤسسة شبكات الإرسال للاتصالات', '2050136287', '8116671490662190878', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(395, 'مؤسسة هياء أحمد بن نهار القحطاني للاتصالات', '2050138332', '3702495269876678229', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(396, 'مؤسسة الجوال المتقدم للاتصالات', '2050139817', '8386311979405149118', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(397, 'مؤسسة خليج الخير للاتصالات', '2050140633', '4217506149527564428', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(398, 'مؤسسة العدسة الذكية للاتصالات', '2051231380', '6485260257847710741', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(400, 'مؤسسة الواحة الذهبي للاتصالات', '2055128207', '7435800410786707915', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(401, 'مؤسسة فرسان الجبيل التجارية', '2055128561', '6082202411682444803', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(402, 'مؤسسة حزام بن محمد بن مبخوت الدوسري لبيع الجوالات وصيانتها', '2057473325', '5509390165172370567', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(403, 'مؤسسة حسين عيسى البدن التجارية', '2051230589', '7123744936234033593', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(404, 'مؤسسة زبرقان التجارية', '2050136889', '8928129074916722192', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(405, 'موسسة باكو للتجارة', '2051233486', '5934677052095803380', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(406, 'مؤسسة علي سعيد بن مسعود آل مهدي للاتصالات', '2050134468', '3300616643074986563', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(407, 'مؤسسة فريق البدر الرياضي للتجارة', '2050135416', '5616937148542078557', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(408, 'مؤسسة مسار الحلم للتجارة', '2050137605', '5173932861162132173', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(409, 'مؤسسة توي ستار التجارية', '2051231778', '6960304380987169851', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(410, 'محل نطاق ابتكار لبيع الجوالات وصيانتها', '2051231852', '3851728113761690134', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(411, 'مؤسسة اجهزة المستقبل للتجارة', '2050139481', '1704464137727388912', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(412, 'مؤسسة رؤية الجوهرة لتقنية المعلومات', '2051231543', '5345737522191209218', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(413, 'مؤسسة وادي النظم التجارية', '2051231691', '2029834539507875787', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(414, 'مؤسسة نجاح المحاسبة لتقنية المعلومات', '2050134710', '7197837695791266202', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(415, 'مؤسسة عمر مشعل بن ابراهيم الصقير لتقنية المعلومات', '2051229093', '6151593235712848788', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(416, 'مؤسسة محمد جعفر بن حسين آل درويش التجارية', '2051230356', '9215487076867394670', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(417, 'مؤسسة فلاح لافي حديد الحربي لمواد البناء', '2057473397', '2782307664777909793', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(418, 'مؤسسة تمكين الشرق التجارية', '2050132682', '6476147534024649623', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(419, 'مؤسسة صالح عطيه الزهراني للإطارات', '2050132129', '8485238338234634831', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(420, 'مؤسسة يافع الخضراء التجارية', '2050137916', '2751935061404379920', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(421, 'مؤسسة حمد صالح بن سالم الشهي للاطارات', '2050140376', '9257179564522465964', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(422, 'مؤسسة خلود عبدالله ظافر آل سلوم للإطارات', '2051229499', '2207611480242927128', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(423, 'مؤسسة شباب البحرين للإطارات', '2051229866', '5253206687042101658', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(424, 'مؤسسة عماد على بن احمد الزهراني التجارية', '2050132471', '1856351155137237344', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(425, 'مؤسسة دروب الطريق التجارية', '2050135555', '9564443163531744357', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(426, 'مؤسسة محسنه مرشد عسكر صلاح للتجارة', '2050140879', '2694797870904976596', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(427, 'شركة الجميح للاطارات المحدودة', '2055127332', '7604572887686510374', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(428, 'مؤسسة سميره سعيد بن علي القاسم التجارية', '2050133024', '8314838960936641276', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(429, 'مؤسسة نواف محمد بن عبدالرحمن المبرزي للبطاريات', '2050135088', '4295695280252475604', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(430, 'مؤسسة جوهرة دله للبطاريات', '2050135119', '6437114366824070607', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(431, 'مؤسسة محمد مهدي محمد اليامي للتجارة', '2050135441', '9299896825532017366', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(432, 'مؤسسة منصور علي حسن مدخلي لتجارة الجملة و التجزئة', '2050135726', '9531392559197097659', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(433, 'مؤسسة حكاية عبير للبطاريات', '2050136924', '4153114976981089112', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(434, 'مؤسسة أنوار الشرقية للبطاريات', '2050137528', '3435364111619599898', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(435, 'مؤسسة صالح سعيد عبدالله البريكي للبطاريات', '2050138845', '5040883175255731514', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(436, 'مؤسسة بوابة القطع للتجارة', '2050139047', '7163225187308966304', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(437, 'مؤسسة حنان سالم شينان العيسي للبطاريات', '2050140920', '9079662319282160609', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(438, 'مؤسسة علي أحمد على حكمي للبطاريات', '2051229182', '6575521781249376596', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(439, 'مؤسسة محمد عبدالعزيز احمد الراجحي للبطاريات', '2051232279', '1586710089281037218', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(440, 'مؤسسة جزء مشرق للتجارة', '2055128218', '2928532322388627857', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(441, 'مؤسسة صالح سالم المهري التجارية', '2055128239', '6655893135277758687', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(442, 'مؤسسة صالح سعيد عبدالله البريكي للبطاريات', '2055128611', '5078765298036244325', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(443, 'مؤسسة زمزم بنت علي بن محمد السليم التجارية', '2060622851', '4273490616905392614', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(444, 'مؤسسة حمد بن حميد بن بسيس الهذلي للبطاريات', '2066612073', '2796273190791410279', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(445, 'مؤسسة صابرين يحي على جعونى للمقاولات العامة', '2050137638', '1788195669433178970', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(446, 'مؤسسة البناء الدائم للمقاولات', '2051233064', '7303348822603659516', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(447, 'شركة كانو لخدمات الخزانات', '2050132527', '9417215846035488808', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(448, 'ورشة فهد سامر ضبان المطيري لصيانة المعدات', '2055127440', '7747961659585315400', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(449, 'مؤسسة إمداد الخليج للصيانة', '2050131947', '1441399187334554708', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(450, 'شركة سيمنس للطاقة', '2051231499', '8724833910785671186', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(451, 'ورشة لفات تقنية الخليج الصناعية', '2055127334', '2911371819985186300', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(452, 'ورشة الهدى الصناعية', '2055127822', '8423652528549217320', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(453, 'مؤسسة مكانكم لتقنية المعلومات', '2050133195', '8818823852523260715', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(454, 'مؤسسة شبكة المنهاج لتقنية المعلومات', '2050136861', '4020481781806832274', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(455, 'مؤسسة تزايد للاتصالات و تقنية المعلومات', '2051230025', '1857198561646245650', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(456, 'مؤسسة منطقة المستقبل للاتصالات و تقنية المعلومات', '2051230152', '9531735981063054283', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(457, 'مؤسسة استضافة مربع لتقنية المعلومات', '2051230352', '2017311525788599855', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(458, 'مؤسسة علي عدنان بن باقر الحداد للاتصالات و تقنية المعلومات', '2051230487', '9615641021936237141', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(459, 'مؤسسة كيان سوفت لتقنية المعلومات', '2051231496', '3533584662548295921', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(460, 'مؤسسة النمط الرائع لتقنية المعلومات', '2055127569', '6727797266326903715', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(461, 'مؤسسة الدكان العجيب لتقنية المعلومات', '2055128326', '7759168277574845436', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(462, 'مؤسسة اتاح لتقنية المعلومات', '2055128342', '7604510669668277686', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(463, 'مؤسسة خالد بن سعود بن دغش الهاجري لتقنية المعلومات', '2060622867', '3300328797838052110', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(464, 'فرع شركة نيلم تكنولوجيز ش ش', '2050133475', '4007881768416793252', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(465, 'شركة تربه الشمال للزراعة', '2051230913', '8167188482517448271', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(466, 'مؤسسة عصام بن عثمان بن عبدالواحد اليوسف للمقاولات العامة', '2055129205', '1885395194686981577', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(467, 'مكتب نخيل الواحة للاستشارات الادارية', '2050138141', '1862806263954824727', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(468, 'مكتب برق السمان للاستشارات الادارية', '2050140571', '7364210610766380175', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(469, 'مكتب عبدالله بن علي بن محمد الصانع للاستشارات الادارية', '2050141005', '9097477958381848111', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(470, 'مكتب ادارات المرافق للاستشارات الادارية', '2051232516', '5747913785763112354', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(471, 'مكتب عبدالعزيز محمد علي الوادعي للاستشارات الادارية', '2055128573', '5191708795554487913', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(472, 'مكتب جدا للاستشارات الادارية', '2050137977', '1310719119716090226', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(473, 'مكتب بوارق للاستشارات الادارية', '2050139902', '5795720469387286408', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(474, 'مكتب النور الاول للاستشارات الادارية', '2050140822', '1656172213741524495', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(475, 'مكتب ذياب عايد العنزي للاستشارات الادارية', '2057473065', '8770445186479496400', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(476, 'مكتب رائد بن عبدالله بن ابراهيم العجاجي للاستشارات الصناعية', '2055127799', '6156401210669529965', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(477, 'شركة بيت الخبرة للاستشارات الصناعية', '2055128220', '1593728741674626931', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(478, 'مكتب خلايا فعاله للاستشارات الفنية والمختبرات', '2050133443', '2602278484178805876', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(479, 'مكتب رواد التميز للإستشارات الفنية والمختبرات', '2050140401', '2222843564639056325', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(480, 'مكتب مشاري مطلق بن سفر العتيبي للإستشارات المالية لغير الأوراق المالية', '2057473400', '1866780037108678838', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(481, 'مكتب الحياة للإستشارات المالية لغير الأوراق المالية', '2050138059', '9017491234997356548', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(482, 'مكتب رياس للإستشارات المالية لغير الأوراق المالية', '2051233060', '6822618114781811173', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(483, 'مكتب عبدالله عبدالمحسن علي الشايب للاستشارات الهندسية', '2050133316', '1160437037334357339', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(484, 'مكتب ديوان العمارة للاستشارات الهندسية', '2050133938', '9385769592028292948', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(485, 'مكتب سامي بن علي بن عبدالله الماضي للاستشارات الهندسية', '2050134669', '5041834044974790294', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(486, 'مكتب شبكة الانجاز للاستشارات الهندسية', '2050137131', '7584500734281353402', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(487, 'مكتب رنا منيراحمد قاضي القاضي للاستشارات الهندسية', '2050137218', '3966432222149260199', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(488, 'مكتب شلال فرحان جلال الشمري للاستشارات الهندسية', '2050138906', '3885911327724972232', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(489, 'مكتب حسن محمدصغير علي فقيه للاستشارات الهندسية', '2050139949', '5256170665764109802', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(490, 'مكتب بسمه خيري عبدالحليم بدر للاستشارات الهندسية', '2050140731', '7799190686487771448', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(491, 'مكتب مدن المستقبل للاستشارات الهندسية', '2050140792', '9573672111511462779', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(492, 'مكتب نبراس احمد بن علي آل ثواب للاستشارات الهندسية', '2050141021', '2339747240654654363', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(493, 'مكتب أحمد بن عبداللطيف بن احمد البراك للاستشارات الهندسية', '2051229932', '3731935578745347667', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(494, 'مكتب المعماريون السعوديون للاستشارات الهندسية', '2051230088', '8011718931439477214', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(495, 'مكتب عمرو فريد محمد زيدان للاستشارات الهندسية', '2051230484', '5763773062502037195', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(496, 'مكتب محمد أحمد رشيد الرشيد للاستشارات الهندسية', '2051230585', '2411344352214630240', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(497, 'مكتب ارتداد للاستشارات الهندسية', '2051230629', '3447374510275160106', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(498, 'شركة تكنيكاس ريونيداس العالمية للاستشارات الهندسية شركة الشخص الواحد', '2051230837', '9278946213648950572', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(499, 'شركة الخبراء المميزين للاستشارات الهندسية', '2051231050', '4942857472276414432', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(500, 'مكتب العمارة العربية للاستشارات الهندسية', '2051231106', '2579177686178516576', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(501, 'شركة مساحة للاستشارات الهندسية', '2051231178', '6651256618682058778', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(502, 'فرع شركة الرؤية الحديثة للاستشارات الهندسية', '2051231264', '2334477789041770751', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(503, 'مكتب أنس سعيد سعدي عسيري للاستشارات الهندسية', '2051231355', '8035188549654145304', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(504, 'مكتب الارتكاز للاستشارات الهندسية', '2051231709', '1138728797803110686', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(505, 'مكتب مهند محمد القرون للاستشارات الهندسية', '2051231836', '7238577452043444388', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(506, 'مكتب راديان للاستشارات الهندسية', '2051232698', '7232769960698672561', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(507, 'شركة البيكس الشرق الاوسط للاستشارات الهندسية', '2051232805', '3985368587649323691', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(508, 'مكتب نايل بن دهلوس بن نايل الرشيد للاستشارات الهندسية', '2051232844', '2307579854054422662', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(509, 'مكتب أروى محمد احمد عسيري للاستشارات الهندسية', '2051232965', '8655427672778907829', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(510, 'مكتب شقير صعفق حاكم الدويش للاستشارات الهندسية', '2051233512', '4725827290089474927', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(511, 'مكتب دقة التصاميم للاستشارات الهندسية', '2057473341', '8169572714381232935', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(512, 'مكتب بداية للاستشارات الهندسية', '2057473547', '2782129538116669507', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(513, 'مكتب سعد بن زاهي بن درويش الشمري للاستشارات الهندسية', '2055127401', '3314601648614015964', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(514, 'مكتب المنفذ الثلاثي للاستشارات في مجال الاتصالات وتقنية المعلومات', '2050135296', '4675923385207979380', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(515, 'مكتب تكامل الذكاء والبدائل للاستشارات في مجال الاتصالات وتقنية المعلومات', '2050136455', '9028643230795427537', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(516, 'مكتب يوسف عبدالله العريفي للاستشارات في مجال الحاسب الآلي', '2050133078', '5641795379743965705', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(517, 'مكتب يوسف بن احمد بن حسن ال موسى للاستشارات في مجال الزكاة وضريبة الدخل', '2050136150', '9710120378026564686', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(518, 'مكتب ميسان للاستشارات في مجال الزكاة وضريبة الدخل', '2050137221', '9582690212356095357', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(519, 'مكتب مفلح بن دواس بن مبارك الخالدي للاستشارات في مجال الزكاة وضريبة الدخل', '2050137417', '7238569861516665316', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(520, 'مكتب لميس حسن جميل ثقه للاستشارات في مجال الزكاة وضريبة الدخل', '2051230875', '4843772045165501841', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(521, 'مكتب علي عدنان بن باقر الحداد للاستشارات في مجال الزكاة وضريبة الدخل', '2051232523', '1575331757552202237', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(522, 'مؤسسة صبا التجارية', '2050137000', '4816957411688119863', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(523, 'مؤسسة هزاع بن ناصر بن علي الشمراني التجارية', '2051230145', '7851749558891597536', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(524, 'مؤسسة رايات الاعمال التجارية', '2051231880', '2712749223784233235', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(525, 'مؤسسة العشب الاخضر التجارية', '2050132289', '4117262634426839873', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(526, 'مؤسسة فن العشب التجارية', '2050133761', '8332845763591672505', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(527, 'مؤسسة ضياء العشب التجارية', '2050138854', '9122305345294574147', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(528, 'مؤسسة وردة شامية للتجارة', '2050139710', '5951922889347255571', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(529, 'مؤسسة عشب البستان التجارية', '2050140280', '5406200512112936270', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(530, 'مؤسسة فاطمه جابر بن احمد العوض لتأجير المعدات', '2050132505', '1835199324947193847', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(531, 'مؤسسة دولية المتكاملة التجارية', '2050132371', '4149162313082090545', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(532, 'مؤسسة فهد بن محمد بن علي الزهراني للالات والمعدات', '2050139302', '8848835376714242639', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(533, 'مؤسسة سعد حسن عوده الجلاسي التجارية', '2050140440', '6920632539098559943', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(534, 'مؤسسة مرجان الشرق للتجارة', '2051229946', '6516355873072176560', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(535, 'مؤسسة مرتضى سعيد بن محمد سبيتي للتجارة', '2055127879', '2812535869461638732', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(536, 'مؤسسة بخيت عيظه الزهراني التجارية', '2066612151', '1564321416659575232', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(537, 'مؤسسة اجهزه الاطفاء للتجارة', '2050132524', '1065192173749482938', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(538, 'مؤسسة رؤيا الاعمال لاجهزة السلامة', '2050134520', '6817141594282440330', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(539, 'مؤسسة نوره بنت بلال بن سالم الدوسري التجارية', '2050135442', '1376472948839424194', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(540, 'مؤسسة علي ناصر بن محمد السلطان لاجهزة السلامة', '2050136386', '7662824430055698491', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(541, 'مؤسسة علي حسين احمد بجوي التجارية', '2050137253', '5984214417425331800', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(542, 'مؤسسة متعب بن عبدالله بن شاهر الشمري لاجهزة السلامة', '2050137318', '6961429036704742161', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(543, 'مؤسسة نسمة الخليج لاجهزة السلامة', '2050137335', '8539452151298700475', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(544, 'مؤسسة احمد سالم مران اليامي لاجهزة السلامة', '2050138379', '5298808321887337248', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(545, 'مؤسسة معجبه علي محمد آل المحاضي لاجهزة السلامة', '2051229121', '1760570840036017415', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(546, 'مؤسسة ديوان الخبر لاجهزة السلامة', '2051230554', '3447553546606453876', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(547, 'مؤسسة الفارس الخيال لاجهزة السلامة', '2051232409', '8792631139552232691', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(548, 'مؤسسة أداة المشروع للتجارة', '2055127755', '3482496929796976887', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(549, 'مؤسسة حسن أحمد يوسف الصومالي لاجهزة السلامة', '2055127877', '6748540527994728827', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(550, 'مؤسسة زين الكون التجارية', '2055128498', '2609685965942879521', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(551, 'مؤسسة عبدالرحمن مساعد ابن مخاسر الشمراني للتجارة', '2055129183', '3022799038216264467', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(552, 'مؤسسة زايد جمعان صالح الدوسري لاجهزة السلامة', '2050136285', '3103484525979064703', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(553, 'مؤسسة تداول التدفق للتجارة', '2050137831', '9645961942609225251', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(554, 'مؤسسة علي سعيد عبدالله الغامدي لاجهزة السلامة', '2050138378', '4501939513896418651', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(555, 'مؤسسة نجوم الحريق للتجارة', '2050140138', '9741110715493978645', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(556, 'شركة الخليج للانظمه الصناعية', '2051229844', '9267299597136898713', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(557, 'مؤسسة فاطمه عبدالله بن حسن المحمدعلي لصيانة المعدات', '2050136418', '5422453087164333588', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(558, 'مؤسسة الوسط البديل لصيانة المعدات', '2050141068', '6981412748095857550', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(559, 'مؤسسة موثوقة و مسؤولة للصيانة', '2051229483', '4170219671295804386', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(560, 'مؤسسة قمة التفتيش للصيانة', '2057473256', '2327645422111973752', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(561, 'مؤسسة أصول الرخام للمقاولات العامة', '2050134156', '8874264585744775457', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(562, 'مصنع أحمد عيسى بن علي الدوسري للصناعة', '2050137566', '7119247893217670386', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(563, 'مصنع عبدالخالق محمد حسين الوادعي للصناعة', '2050139237', '8686595873728173972', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(564, 'مصنع زين صالح سالم ال منجم للحديد', '2050140959', '8452684885241615816', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(565, 'مصنع نايف سعد بن مرعي القحطاني للأنابيب', '2055128950', '8557603131386632178', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(566, 'مصنع أماني نومان بن فرحان الشمري للصناعة', '2057473007', '6441134569865853318', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(567, 'مصنع عبدالله سليمان بن غريب الشمري للحديد', '2057473108', '4641500971397203288', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(568, 'شركة الفاس التجارية (شركة شخص واحد)', '2051230316', '3771339139064227457', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(569, 'مؤسسة المحيط الهادئ المتحدة للتجارة', '2051231485', '4107837443612099236', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(570, 'مؤسسة وهج الشرقية التجارية', '2055128060', '2161974845256137347', NULL, 1, '2022-08-18 17:46:26', '2022-08-18 17:46:26'),
(571, 'XXXX', '222', '333', '444', 0, '2022-08-19 11:54:29', '2022-08-19 20:45:16'),
(572, 'dsfds434rfdfd', 'fdgf45ytgfcxfg5', 'trfvc5trfd', ' dsvddsdsc', 0, '2022-08-19 22:03:34', '2022-08-19 22:03:59'),
(573, 'sd34refd45trfd', 'cxxdr5tygffr56tgf', 'cft67uyhgffdfrtr', ' hgvre45trgfvc', 0, '2022-08-19 22:03:52', '2022-08-19 22:04:05'),
(574, '4444444444', '4444444444', '444444444', ' 444444444444', 0, '2022-08-19 22:06:29', '2022-08-19 22:08:26');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `is_admin` int(11) DEFAULT 0,
  `max_list` varchar(10) NOT NULL DEFAULT '100',
  `is_active` int(11) NOT NULL DEFAULT 1,
  `clear_pass` varchar(50) DEFAULT NULL,
  `user_2fa_enable` int(11) DEFAULT 0,
  `user_2fa_secret` varchar(50) DEFAULT NULL,
  `user_2fa_code` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `created_at`, `is_admin`, `max_list`, `is_active`, `clear_pass`, `user_2fa_enable`, `user_2fa_secret`, `user_2fa_code`) VALUES
(1, 'aymanoz', '$2y$10$BQ5DLfk1XuTrR2ePDt38FuvycswyPs77NQvu2RnKFqxiyWZ79elSy', '2022-05-17 19:21:05', 1, '25', 1, '1234512345', 1, 'HLVMATXSVUDLKDYV', ''),
(4, 'admin', '$2y$10$YLmOh1mihx620toUI5kH9ObzGUDVCbi3bnd2YnPwFPvj9RVlmFuSW', '2024-01-07 14:33:17', 1, '100', 1, '123456', 1, 'UCIZBRRRGVHTBMYV', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `config`
--
ALTER TABLE `config`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `invoice`
--
ALTER TABLE `invoice`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `no` (`no`);

--
-- Indexes for table `sappo`
--
ALTER TABLE `sappo`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `no` (`no`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `cr` (`cr`),
  ADD UNIQUE KEY `vat` (`vat`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `config`
--
ALTER TABLE `config`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `invoice`
--
ALTER TABLE `invoice`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `sappo`
--
ALTER TABLE `sappo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=575;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
